---
kind: property
id: P:Autodesk.Revit.DB.ParameterMap.Item(System.String)
source: html/1bdb4e62-aa70-b80b-ec3b-42b3f2819130.htm
---
# Autodesk.Revit.DB.ParameterMap.Item Property

Gets or sets an item at a specified key within the map.

## Syntax (C#)
```csharp
public virtual Parameter this[
	string key
] { get; set; }
```

## Parameters
- **key** (`System.String`) - The key of the item to be set or retrieved.

## Returns
Returns the object at the specified key.